---
kind: other
id: Properties.T:Autodesk.Revit.DB.TriangleInShellComponent
source: html/4bb37d25-f85c-8e2f-6c0a-1c8eb66aa6dd.htm
---
# TriangleInShellComponent Properties

Specifies whether the .NET object represents a valid Revit entity.